---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.NoViewSpecificSiteImports
source: html/c4533c3c-8581-2f27-cf02-ea960a87e4a9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.NoViewSpecificSiteImports Property

Can't make Toposurface from View Specific Imports.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoViewSpecificSiteImports { get; }
```